Ran Plan for dir: `terraform/ecs-web-api` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/ryu-qqq/CrawlingHub/50/default/terraform/ecs-web-api/crawlinghub-ecs-web-api-prod-default.tfplan\"" in "/home/atlantis/.atlantis/repos/ryu-qqq/CrawlingHub/50/default/terraform/ecs-web-api": exit status 1
data.aws_ssm_parameter.amp_workspace_arn: Reading...
data.aws_ssm_parameter.certificate_arn: Reading...
data.aws_ssm_parameter.route53_zone_id: Reading...
data.aws_secretsmanager_secret.rds: Reading...
data.aws_ecs_cluster.main: Reading...
data.aws_ssm_parameter.public_subnets: Reading...
data.aws_ssm_parameter.vpc_id: Reading...
module.ecs_service.data.aws_region.current: Reading...
data.aws_ssm_parameter.private_subnets: Reading...
data.aws_ssm_parameter.amp_remote_write_url: Reading...
module.ecs_service.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
module.web_api_logs.aws_cloudwatch_log_group.this: Refreshing state... [id=/aws/ecs/crawlinghub-web-api-prod/application]
data.aws_ssm_parameter.amp_workspace_arn: Read complete after 0s [id=/shared/monitoring/amp-workspace-arn]
data.aws_ecr_repository.web_api: Reading...
data.aws_ssm_parameter.vpc_id: Read complete after 0s [id=/shared/network/vpc-id]
data.aws_ssm_parameter.certificate_arn: Read complete after 0s [id=/shared/network/certificate-arn]
data.aws_ssm_parameter.route53_zone_id: Read complete after 0s [id=/shared/network/route53-zone-id]
module.ecs_task_execution_role.aws_iam_role.this: Refreshing state... [id=crawlinghub-web-api-execution-role-prod]
data.aws_ssm_parameter.private_subnets: Read complete after 0s [id=/shared/network/private-subnets]
data.aws_ssm_parameter.amp_remote_write_url: Read complete after 0s [id=/shared/monitoring/amp-remote-write-url]
module.ecs_service.data.aws_caller_identity.current: Reading...
module.ecs_task_execution_role.data.aws_region.current: Reading...
module.ecs_task_execution_role.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
data.aws_ssm_parameter.eventbridge_role_arn: Reading...
data.aws_ssm_parameter.public_subnets: Read complete after 0s [id=/shared/network/public-subnets]
data.aws_elasticache_cluster.redis: Reading...
data.aws_ecs_cluster.main: Read complete after 0s [id=arn:aws:ecs:ap-northeast-2:646886795421:cluster/crawlinghub-cluster-prod]
data.aws_secretsmanager_secret.rds: Read complete after 0s [id=arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:crawlinghub/rds/credentials-6wYxDG]
data.aws_ssm_parameter.amp_workspace_id: Reading...
module.ecs_service.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
module.ecs_task_role.aws_iam_role.this: Refreshing state... [id=crawlinghub-web-api-task-role-prod]
data.aws_ssm_parameter.eventbridge_trigger_queue_arn: Reading...
module.ecs_task_execution_role.data.aws_caller_identity.current: Reading...
module.ecs_task_role.data.aws_caller_identity.current: Reading...
module.ecs_task_role.data.aws_region.current: Reading...
module.ecs_task_role.data.aws_region.current: Read complete after 0s [id=ap-northeast-2]
data.aws_secretsmanager_secret_version.rds: Reading...
module.ecs_task_role.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
module.ecs_task_execution_role.data.aws_caller_identity.current: Read complete after 0s [id=646886795421]
data.aws_ssm_parameter.eventbridge_role_arn: Read complete after 0s [id=/crawlinghub/eventbridge/role-arn]
data.aws_ssm_parameter.amp_workspace_id: Read complete after 0s [id=/shared/monitoring/amp-workspace-id]
module.ecs_security_group.aws_security_group.this: Refreshing state... [id=sg-02997a2675e266a40]
module.alb_security_group.aws_security_group.this: Refreshing state... [id=sg-08eb1fa30c689e592]
data.aws_secretsmanager_secret_version.rds: Read complete after 0s [id=arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:crawlinghub/rds/credentials-6wYxDG|AWSCURRENT]
data.aws_ssm_parameter.eventbridge_trigger_queue_arn: Read complete after 0s [id=/crawlinghub/sqs/eventbridge-trigger-queue-arn]
module.alb.aws_lb_target_group.this["web-api"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:targetgroup/crawlinghub-alb-prod-web-api/317bc1ed4a01878e]
data.aws_elasticache_cluster.redis: Read complete after 0s [id=crawlinghub-redis-prod]
module.alb_security_group.aws_vpc_security_group_ingress_rule.alb-http["0.0.0.0/0"]: Refreshing state... [id=sgr-07cd584511154f7cc]
module.ecs_security_group.aws_vpc_security_group_egress_rule.default[0]: Refreshing state... [id=sgr-0c787c9cabd647494]
module.ecs_security_group.aws_vpc_security_group_ingress_rule.ecs-from-alb[0]: Refreshing state... [id=sgr-0180eebfd172b62e6]
module.alb_security_group.aws_vpc_security_group_egress_rule.default[0]: Refreshing state... [id=sgr-062609eabf13aa506]
module.alb_security_group.aws_vpc_security_group_ingress_rule.alb-https["0.0.0.0/0"]: Refreshing state... [id=sgr-00a0bb1d5c9abb669]
module.alb.aws_lb.this: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:loadbalancer/app/crawlinghub-alb-prod/d1dbe35850991a10]
data.aws_ecr_repository.web_api: Read complete after 0s [id=crawlinghub-web-api-prod]
module.alb.aws_lb_listener.https["https"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:listener/app/crawlinghub-alb-prod/d1dbe35850991a10/eb7439e00b2187d4]
module.alb.aws_lb_listener.http["http-redirect"]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:listener/app/crawlinghub-alb-prod/d1dbe35850991a10/b70f198886f99ce7]
aws_route53_record.web_api: Refreshing state... [id=Z104656329CL6XBYE8OIJ_crawler.set-of.com_A]
module.ecs_task_execution_role.aws_iam_role_policy.custom["ssm-access"]: Refreshing state... [id=crawlinghub-web-api-execution-role-prod:crawlinghub-web-api-execution-role-prod-ssm-access]
module.ecs_task_execution_role.aws_iam_role_policy_attachment.aws-managed["arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"]: Refreshing state... [id=crawlinghub-web-api-execution-role-prod-20251128025726549700000001]
module.ecs_task_execution_role.aws_iam_role_policy.secrets-manager[0]: Refreshing state... [id=crawlinghub-web-api-execution-role-prod:crawlinghub-web-api-execution-role-prod-secrets-manager]
module.ecs_task_role.aws_iam_role_policy.custom["eventbridge-access"]: Refreshing state... [id=crawlinghub-web-api-task-role-prod:crawlinghub-web-api-task-role-prod-eventbridge-access]
module.ecs_task_role.aws_iam_role_policy.custom["adot-amp-access"]: Refreshing state... [id=crawlinghub-web-api-task-role-prod:crawlinghub-web-api-task-role-prod-adot-amp-access]
module.ecs_service.aws_ecs_task_definition.this: Refreshing state... [id=crawlinghub-web-api-prod]
module.ecs_service.aws_ecs_service.this: Refreshing state... [id=arn:aws:ecs:ap-northeast-2:646886795421:service/crawlinghub-cluster-prod/crawlinghub-web-api-prod]
module.ecs_service.aws_appautoscaling_target.this[0]: Refreshing state... [id=service/crawlinghub-cluster-prod/crawlinghub-web-api-prod]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # module.ecs_service.aws_ecs_service.this will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:ap-northeast-2:646886795421:service/crawlinghub-cluster-prod/crawlinghub-web-api-prod"
        name                               = "crawlinghub-web-api-prod"
        tags                               = {
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Description" = "ECS service for crawlinghub-web-api-prod"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "crawlinghub-web-api-prod"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "crawlinghub"
            "Service"     = "crawlinghub-web-api"
        }
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/crawlinghub-web-api-prod:64" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs_service.aws_ecs_task_definition.this must be replaced
-/+ resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/crawlinghub-web-api-prod:64" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/crawlinghub-web-api-prod" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "crawlinghub-web-api-prod" -> (known after apply)
      ~ revision                 = 64 -> (known after apply)
        tags                     = {
            "CostCenter"  = "engineering"
            "DataClass"   = "confidential"
            "Description" = "ECS task definition for crawlinghub-web-api-prod"
            "Environment" = "prod"
            "Lifecycle"   = "production"
            "ManagedBy"   = "terraform"
            "Name"        = "crawlinghub-web-api-prod"
            "Owner"       = "platform@ryuqqq.com"
            "Project"     = "crawlinghub"
            "Service"     = "crawlinghub-web-api"
        }
        # (12 unchanged attributes hidden)
    }

  # module.ecs_task_role.aws_iam_role_policy.custom["eventbridge-access"] will be updated in-place
  ~ resource "aws_iam_role_policy" "custom" {
        id          = "crawlinghub-web-api-task-role-prod:crawlinghub-web-api-task-role-prod-eventbridge-access"
        name        = "crawlinghub-web-api-task-role-prod-eventbridge-access"
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change.
      ~ policy      = (sensitive value)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  ~ task_definition_arn = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/crawlinghub-web-api-prod:64" -> (known after apply)
╷
│ Error: reading Application AutoScaling Target (service/crawlinghub-cluster-prod/crawlinghub-web-api-prod): operation error Application Auto Scaling: DescribeScalableTargets, https response error StatusCode: 400, RequestID: d71eb4b5-a1ba-4a95-8ee3-d21331da74b5, api error AccessDeniedException: User: arn:aws:sts::646886795421:assumed-role/atlantis-ecs-task-prod/a4f2b7d7200c4b82930c5cb857e43245 is not authorized to perform: application-autoscaling:DescribeScalableTargets on resource: arn:aws:application-autoscaling:ap-northeast-2:646886795421:scalable-target/* because no identity-based policy allows the application-autoscaling:DescribeScalableTargets action
│ 
│   with module.ecs_service.aws_appautoscaling_target.this[0],
│   on .terraform/modules/ecs_service/terraform/modules/ecs-service/main.tf line 201, in resource "aws_appautoscaling_target" "this":
│  201: resource "aws_appautoscaling_target" "this" {
│ 
╵

```
</details>